## Plan Result (prod_shutter_webapp)




<pre><code>Plan: 3 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;child-adoption&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;child-adoption&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;child-adoption&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.static_webapp.azurerm_dns_cname_record.cname_record["child-adoption"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "child-adoption-shutter"
      + record              = "proud-water-0b79bd003.4.azurestaticapps.net"
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "apply-to-adopt-a-child-placed-in-your-care.service.gov.uk"
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["child-adoption"] will be created
  + resource "azurerm_dns_txt_record" "zone_validate" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth"
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "apply-to-adopt-a-child-placed-in-your-care.service.gov.uk"

      + record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.static_webapp.github_actions_secret.secret["child-adoption"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "child_adoption_prod"
      + updated_at      = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ debug_shutter = [
        # (39 unchanged elements hidden)
        {
            backend_domain    = [
                "firewall-prod-int-palo-cftprod.uksouth.cloudapp.azure.com",
            ]
            certificate_name  = "helpwithcourtfees-service-gov-uk"
            custom_domain     = "helpwithcourtfees.service.gov.uk"
            dns_zone_name     = "helpwithcourtfees.service.gov.uk"
            global_exclusions = [
                {
                    match_variable = "RequestCookieNames"
                    operator       = "Equals"
                    selector       = "cookie_setting"
                },
                {
                    match_variable = "RequestCookieNames"
                    operator       = "Equals"
                    selector       = "_hwf-publicapp_session"
                },
                {
                    match_variable = "RequestCookieNames"
                    operator       = "Equals"
                    selector       = "_fr-staffapp_session"
                },
                {
                    match_variable = "RequestCookieNames"
                    operator       = "Equals"
                    selector       = "_ga"
                },
                {
                    match_variable = "RequestCookieNames"
                    operator       = "Equals"
                    selector       = "_gat"
                },
                {
                    match_variable = "RequestCookieNames"
                    operator       = "Equals"
                    selector       = "_gid"
                },
                {
                    match_variable = "RequestBodyPostArgNames"
                    operator       = "Equals"
                    selector       = "address_lookup_url"
                },
                {
                    match_variable = "RequestBodyPostArgNames"
                    operator       = "Equals"
                    selector       = "authenticity_token"
                },
                {
                    match_variable = "RequestBodyPostArgNames"
                    operator       = "Equals"
                    selector       = "notification[message]"
                },
            ]
            mode              = "Prevention"
            name              = "hwf-pet"
            product           = "hwf-pet"
            shutter_app       = true
            ssl_mode          = "AzureKeyVault"
        },
      + {
          + backend_domain    = [
              + "firewall-prod-int-palo-cftprod.uksouth.cloudapp.azure.com",
            ]
          + certificate_name  = "apply-to-adopt-a-child-placed-in-your-care-service-gov-uk"
          + custom_domain     = "apply-to-adopt-a-child-placed-in-your-care.service.gov.uk"
          + dns_zone_name     = "apply-to-adopt-a-child-placed-in-your-care.service.gov.uk"
          + global_exclusions = [
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "Equals"
                  + selector       = "connect.sid"
                },
              + {
                  + match_variable = "QueryStringArgNames"
                  + operator       = "Equals"
                  + selector       = "iss"
                },
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "Equals"
                  + selector       = "session"
                },
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "StartsWith"
                  + selector       = "__auth-token"
                },
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "Equals"
                  + selector       = "_ga"
                },
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "Equals"
                  + selector       = "_gid"
                },
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "Equals"
                  + selector       = "_gat"
                },
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "Equals"
                  + selector       = "dtCookie"
                },
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "Equals"
                  + selector       = "dtLatC"
                },
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "Equals"
                  + selector       = "dtPC"
                },
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "Equals"
                  + selector       = "dtSa"
                },
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "Equals"
                  + selector       = "rxVisitor"
                },
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "Equals"
                  + selector       = "rxvt"
                },
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "Equals"
                  + selector       = "cookies_policy"
                },
              + {
                  + match_variable = "QueryStringArgNames"
                  + operator       = "Equals"
                  + selector       = "rf"
                },
            ]
          + mode              = "Detection"
          + name              = "child-adoption"
          + product           = "adoption"
          + www_redirect      = true
        },
    ]
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1843,"Program":"tfcmt","SHA1":"","Target":"prod_shutter_webapp","Vars":{}} -->